# Ramen

## Tasks

### 1. Read the data from the CSV file into a DataFrame.

In [1]:
import pandas as pd
ramen_file = 'ramen-ratings.csv'
df = pd.read_csv(ramen_file)

### 2. Display the first five rows of data.

In [2]:
df.head()

,Brand,Variety,Style,Country,Stars
0,New Touch,T's Restaurant Tantanmen,Cup,Japan,3.75
1,Just Way,Noodles Spicy Hot Sesame Spicy Hot Sesame Guan...,Pack,Taiwan,1.00
2,Nissin,Cup Noodles Chicken Vegetable,Cup,USA,2.25
3,Wei Lih,GGE Ramen Snack Tomato Flavor,Pack,Taiwan,2.75
4,Ching's Secret,Singapore Curry,Pack,India,3.75

### 3. Display the last five rows of data.

In [3]:
df.tail()

,Brand,Variety,Style,Country,Stars
2572,Vifon,"Hu Tiu Nam Vang [""Phnom Penh"" style] Asian Sty...",Bowl,Vietnam,3.5
2573,Wai Wai,Oriental Style Instant Noodles,Pack,Thailand,1.0
2574,Wai Wai,Tom Yum Shrimp,Pack,Thailand,2.0
2575,Wai Wai,Tom Yum Chili Flavor,Pack,Thailand,2.0
2576,Westbrae,Miso Ramen,Pack,USA,0.5

### 4. Display statistical information for the numeric columns using the describe() method.

In [4]:
df.describe()

             Stars
count  2577.000000
mean      3.654676
std       1.015331
min       0.000000
25%       3.250000
50%       3.750000
75%       4.250000
max       5.000000

### 5. Display the number of unique values for each column.

In [5]:
df.nunique()

Brand       355
Variety    2410
Style         7
Country      38
Stars        42
dtype: int64

### 6. Display only rows where the country is Vietnam.

In [6]:
df.query('Country == "Vietnam"')

,Brand,Variety,Style,Country,Stars
18,Binh Tay,Mi Hai Cua,Pack,Vietnam,4.00
52,Uni-President,Mushroom Flavor,Pack,Vietnam,0.00
143,Mum Ngon,Lau Tom Chua Cay,Pack,Vietnam,3.50
224,Vifon,Viet Cuisine Bun Rieu Cua Sour Crab Soup Insta...,Bowl,Vietnam,5.00
365,Acecook,Oh! Ricey Pork Flavour,Pack,Vietnam,4.00
...,...,...,...,...,...
2486,Binh Tay,Mi Chay Mushroom,Pack,Vietnam,2.75
2535,Ve Wong,Kung-Fu Chicken Flavor,Pack,Vietnam,2.75
2570,Ve Wong,Mushroom Pork,Pack,Vietnam,1.00
2571,Vifon,Nam Vang,Pack,Vietnam,2.50
2572,Vifon,"Hu Tiu Nam Vang [""Phnom Penh"" style] Asian Sty...",Bowl,Vietnam,3.50

### 7. Display only the Brand and Style columns.

In [7]:
df[['Brand', 'Style']]

               Brand Style
0          New Touch   Cup
1           Just Way  Pack
2             Nissin   Cup
3            Wei Lih  Pack
4     Ching's Secret  Pack
...              ...   ...
2572           Vifon  Bowl
2573         Wai Wai  Pack
2574         Wai Wai  Pack
2575         Wai Wai  Pack
2576        Westbrae  Pack

[2577 rows x 2 columns]

### 8. Display only the Country column.

In [8]:
df.Country # or df[['Country']]

0          Japan
1         Taiwan
2            USA
3         Taiwan
4          India
          ...
2572     Vietnam
2573    Thailand
2574    Thailand
2575    Thailand
2576         USA
Name: Country, Length: 2577, dtype: object

### 9. Display the data after it has been sorted by the Stars column from high values to low values.

In [12]:
Stars = df[['Stars']].sort_values(by='Stars', ascending=False)
Stars

      Stars
1585    5.0
446     5.0
484     5.0
483     5.0
1613    5.0
...     ...
522     0.0
561     0.0
950     0.0
2079    0.0
52      0.0

[2577 rows x 1 columns]

### 10. In the Country column, replace “USA” with “United States”. Make sure this change is saved in the DataFrame, and then display the first five rows to be sure the change was made correctly

In [13]:
df.Country.replace('USA', 'United States').head()

0            Japan
1           Taiwan
2    United States
3           Taiwan
4            India
Name: Country, dtype: object

## Questions

### 1. How many countries are represented in the data?

In [14]:
num_countries = df['Country'].nunique()
num_countries

38

### 2. Which three countries have the highest average rating?

In [15]:
top_countries = df.groupby('Country')['Stars'].mean().sort_values(ascending=False).head(3)
top_countries

Country
Brazil      4.350000
Sarawak     4.333333
Cambodia    4.200000
Name: Stars, dtype: float64

### 3. Which three countries have the lowest average rating?

In [16]:
b_countries = df.groupby('Country')['Stars'].mean().sort_values().head(3)
b_countries

Country
Nigeria        1.500000
Canada         2.243902
Netherlands    2.483333
Name: Stars, dtype: float64

### 4. Which three countries have the most brands, and how many brands does each of these countries have?

In [17]:
brand_counts = df.groupby('Country')['Brand'].nunique().sort_values(ascending=False)
top_three_countries = brand_counts.head(3)
top_three_countries

Country
Japan     58
USA       49
Taiwan    47
Name: Brand, dtype: int64